Repository: ozbonus/kantan
Catalog: lib/l10n/app_*.arb
Languages: he, ja, zh_tw

# aboutAndInfoTileLabel
source: About {appName}
he: אודות {appName}
ja: 情報と詳細
zh_tw: 關於 kantanplayer

# appLanguageDescription
source: Change the language of the app's interface. This does not change the translation language of transcripts.
he: שנו את שפת הממשק של האפליקציה. פעולה זו לא תשנה את שפת התרגום של התמלולים.
ja: アプリのインターフェース言語を変更します。トランスクリプトの翻訳先言語は変わりません。
zh_tw: 變更 app 介面語言。這不會更改文本的翻譯語言。

# appLanguageListTileLabel
source: Interface language
he: שפת ממשק
ja: インターフェースの言語
zh_tw: 介面語言

# cancelButtonLabel
source: Cancel
he: ביטול
ja: キャンセル
zh_tw: 取消

# canSeeTranscriptTileLabel
source: Can see transcript
he: ניתן לראות תמליל
ja: トランスクリプトを表示する
zh_tw: 可看到文本

# canSeeTranslationTileLabel
source: Can see translation
he: ניתן לראות תרגום
ja: 翻訳を表示する
zh_tw: 可看到翻譯

# changeTextSizeTooltip
source: Change text size
he: שינוי גודל טקסט
ja: 文字サイズの変更
zh_tw: 變更文字大小

# checkAnswerButtonText
source: Check answer
he: בדיקת תשובה
ja: 答を見る
zh_tw: 確認答案

# closeSettingsAndInfoTileLabel
source: Close
he: סגירה
ja: 閉じる
zh_tw: 關閉

source: Dark theme
he: ערכת נושא כהה
ja: ダークテーマ
zh_tw: 暗色主題

# defaultLanguageOptionLabel
source: Default language
he: שפת ברירת-מחדל
ja: デバイスの言語設定
zh_tw: 裝置語言

source: Device theme
he: ערכת נושא של המכשיר
ja: デバイスのテーマ
zh_tw: 裝置主題

# disableModeWindowTitle
source: Disable Mode
he: מצב כבוי
ja: モードを無効にする
zh_tw: 停用模式

# disableParentTeacherModeConfirmationText
source: Would you like to turn off Parent and Teacher Mode?
he: לכבות את מצב הורה מורה?
ja: 保護者・教師モードを無効にしますか？
zh_tw: 要關閉親師模式嗎？

# discObject
source: CD
he: דיסק

# exitFullscreenTooltip
source: Exit fullscreen
he: יציאה ממסך מלא
ja: 全画面表示の終了
zh_tw: 離開全螢幕模式

# fastForwardButtonTooltip
source: Forward five seconds
he: הרץ 5 שניות קדימה
ja: 5秒進む
zh_tw: 快轉五秒

source: Light theme
he: ערכת נושא בהירה
ja: ライトテーマ
zh_tw: 淺色模式

# loadingButtonTooltip
source: Loading
he: טוען
ja: 読み込み中
zh_tw: 載入中

# loadingLabel
source: Loading...
he: טוען...
ja: 読み込み中…
zh_tw: 載入中

# mathChallengeWarning
source: You must solve a math challenge to enable it again.
he: עליכם לפתור תרגיל במתמטיקה כדי להפעיל אותו שוב.
ja: 再び有効にするには数学の問題を解く必要があります。
zh_tw: 您必須解開數學挑戰才能再次啟用。

# noTranslationLanguageOptionLabel
source: None
he: אף אחת
ja: 指定なし
zh_tw: 無

# okButtonText
source: OK
he: אוקיי
zh_tw: 好的

# openPlayerControlsTooltip
source: Open player controls
he: פתיחת בקרי נגינה
ja: プレーヤーコントロールを開く
zh_tw: 開啟播放器控制

# parentAndTeacherModeTileLabel
source: Parent and teacher mode
he: מצב הורה מורה
ja: 保護者・教師モード
zh_tw: 親師模式

# parentTeacherModeActivatedPopup
source: Parent and teacher mode enabled.
he: מצב הורה מורה הופעל.
ja: 保護者・教師モードが有効になりました。
zh_tw: 親師模式已啟用。

# parentTeacherModeWindowTitle
source: For parents and teachers
he: להורים ומורים
ja: 保護者・教師向け
zh_tw: 給家長和老師

# pauseButtonTooltip
source: Pause
he: השהה
ja: 一時停止
zh_tw: 暫停

# playButtonTooltip
source: Play
he: נגן
ja: 再生
zh_tw: 播放

# progressSliderTooltip
source: Seek to time
he: דילוג לזמן
ja: 特定の位置に移動
zh_tw: 前往時間

# repeatModeButtonTooltip
source: Change repeat mode
he: שנה מצב חזרה
ja: リピートモードの変更
zh_tw: 變更重複模式

# replayButtonTooltip
source: Replay all
he: נגן הכל שוב
ja: 全てリプレイ
zh_tw: 重播全部

source: Replay introduction
he: הפעלה מחדש של הפתיח
ja: イントロダクションのリプレイ
zh_tw: 重播說明

# rewindButtonTooltip
source: Rewind five seconds
he: חזור 5 שניות לאחור
ja: 5秒戻る
zh_tw: 倒轉五秒

# settingsAndInfoMenuTitle
source: Settings
he: הגדרות
ja: 設定
zh_tw: 設定

# showTranslationTooltip
source: Show or hide translation
he: הצג או הסתר תרגום
ja: 翻訳の表示/非表示
zh_tw: 顯示或隱藏翻譯

# skipNextButtonTooltip
source: Skip to next
he: דלג אל הבא
ja: 次にスキップ
zh_tw: 跳到下一項

# skipPreviousButtonTooltip
source: Skip to previous
he: דלג אל הקודם
ja: 前にスキップ
zh_tw: 跳到前一項

source: Solve for x
he: מצאו את ערך x
ja: xを求めよ
zh_tw: x 的解

# speedSliderTooltip
source: Change speed
he: שינוי מהירות
ja: スピードの変更
zh_tw: 變更速度

# themeMenuTitle
source: Theme
he: ערכת נושא
ja: テーマ
zh_tw: 主題

# trackObject
source: Track
he: רצועה
ja: トラック
zh_tw: 音軌

# transcriptButtonLabel
source: Transcript
he: תמליל
ja: トランスクリプト
zh_tw: 文本

# transcriptFullscreenTooltip
source: Open fullscreen
he: פתיחת מסך מלא
ja: 全画面表示の開始
zh_tw: 開啟全螢幕模式

# translationLanguageDescription
source: Translations of transcripts are available in these languages. Choose one to show in the transcript screen. This does not change the app's interface language.
he: תרגומי תמלולים זמינים בשפות הבאות. בחרו שפה להצגה במסך התמלול. פעולה זו לא תשנה את שפת הממשק של האפליקציה.
ja: トランスクリプトの翻訳先としてはこれらの言語が利用可能です。トランスクリプト画面に表示する言語を選択してください。アプリのインターフェース言語は変わりません。
zh_tw: 提供這些語言的文本翻譯。請選擇其中一種來顯示在文本畫面中。這不會更改 app 的介面語言。

# translationLanguageListTileLabel
source: Translation language
he: שפת תרגום
ja: 翻訳先言語
zh_tw: 翻譯語言

# wakelockTileLabel
source: Keep screen on
he: השארת מסך דולק
ja: 画面をオンのままにしてください
zh_tw: 保持螢幕開啟

# sizeMultiplierSymbol
source: {size}x
ja: {size}倍

# speedMultiplierSymbol
source: {speed}x
ja: {speed}倍速
